[
  {
    "$id": "1",
    "title": "Cotton Acreage Drops in Gujarat Amid Low Prices",
    "featuredimage": "/images/chickpeas.jpeg",
    "content": "Gujarat, once the undisputed cotton powerhouse of India, is seeing its cotton acreage shrink.\nFarmers are moving to groundnuts and soybeans due to depressed cotton prices.\nMinister Raghavjibhai Patel confirmed that low returns are discouraging cotton cultivation.\nGujarat’s cotton acreage has fallen from 26.79 lakh ha to 23.62 lakh ha in 2024–25.\nMaharashtra has now overtaken Gujarat as India’s top cotton producer.\nCotton pressing: Gujarat - 76 lakh bales, Maharashtra - 85 lakh bales, Telangana - 48 lakh bales.\nIndia's cotton output has declined for 5 consecutive years.\nGlobal production dropped from 39.8M bales (2013–14) to 29.5M bales (2024–25).\nAverage yield is now below 450 kg/ha; China achieves 1,993 kg/ha.\nPink bollworm pest has developed resistance to Bt cotton.\nBollworm attacks destroy bolls within 2 months of flowering.\nClimate change and erratic rainfall have worsened farming conditions.\nSalinity intrusion in coastal Gujarat is damaging crops.\nPreventive structures are being built to stop seawater intrusion.\nDecline in cotton hurts India's textile industry and exports.\nFarmers shift to groundnut and soybean for better income and lower risk.\nStructural reforms and pest control strategies are urgently needed.\nGovernment support is crucial to stabilize prices and pest resistance.\nIntegrated pest management is being recommended over Bt cotton.\nTactics include crop rotation, pheromone traps, and bio-pesticides.\nGlobal cotton demand remains strong; India's falling yield could lead to more imports.\nKharif sowing season puts pressure on farmers to make tough crop choices.\nGujarat’s cotton legacy is threatened by pests, climate change, and market failure.\nWithout strong action, Gujarat may lose its dominance in cotton production.",
    "userId": "system",
    "isDefault": true
  },
  {
    "$id": "2",
    "title": "Gujarat Ramps Up Biofuel Production, Boosting Farmer Income",
    "featuredimage": "/images/msp.jpg",
    "content": "Gujarat is accelerating its shift towards sustainable energy with 14 companies planning to set up ethanol production plants.\nThe move aims to boost biofuel production, cut fossil fuel dependence, and support India's renewable goals.\nA total investment of ₹3,300 crore is planned for 2,800 KLPD capacity.\nAmul has successfully conducted trials producing bioethanol from whey and plans to invest ₹70 crore in a 50,000-litre/day plant.\nThis could add ₹700 crore income for dairy farmers.\nAmul's step aligns with the Centre’s 20% ethanol blending target under the EBP program.\nGrainspan Nutrients Pvt Ltd in Ahmedabad has started ethanol production from maize and rice.\nChairman Sampatraj Chaudhary said the ethanol policy encouraged them to invest.\nHe believes ethanol allows better use of agricultural resources.\nThe Chiripal Group’s 'True Green Bio Energy Ltd' is setting up a 300 KLPD ethanol plant near Ahmedabad with ₹350 crore investment.\nPromoter Deepak Chiripal emphasized that renewable energy reduces oil imports and emissions.\nRaw materials will be sourced from FCI and open markets.\nKineeva Industries LLP is also entering the biofuel sector.\nDirector Pranay Kabra shared plans for a 100 KLPD plant with ₹120 crore investment.\n\"Green fuels are the future, and now is the right time to invest,\" Kabra said.",
    "userId": "system",
    "isDefault": true
  },  
  {
    "$id": "3",
    "title": "McCain Launches Regenerative Agriculture Demo Farm in Sabarkantha",
    "featuredimage": "",
    "content": "This initiative is part of McCain’s global objective to transition 100% of its farming partners to regenerative agricultural methods by 2030.\nThe demonstration farm serves as a practical, real-world example of how innovation and localized solutions can help farmers shift to sustainable practices.\n\nThe farm will demonstrate core principles of regenerative agriculture:\n- Cover cropping and crop rotation to improve biodiversity and soil quality\n- Minimized chemical use to support ecological balance\n- Efficient water usage through precision farming techniques\n- Enhanced soil health for lasting productivity\n\nThe farm will offer farmers, McCain staff, agricultural experts, and partners the opportunity to observe and adopt regenerative practices customized to local conditions.\nSabarkantha was selected for this pilot due to its importance as a key McCain growing region, favorable agro-climatic conditions, and a dedicated farming community.\n(Source: DeshGujarat)",
    "userId": "system",
    "isDefault": true
  }
]
